<font size=10>**CQL 语法简介**</font>



- [2 操作](#2)
  - [2.1 CREATE 命令](#2.1)
  - [2.2 MATCH 命令](#2.1) 
  - [2.3 RETURN 命令](#2.3)
  - [2.4 MATCH&RETURN 匹配和返回](#2.4)
  - [2.5 CREATE+MATCH+RETURN 命令](#2.5)
  - [2.6 关系基础](#2.6)
  - [2.7 CREATE 创建标签](#2.7)
  - [2.8 WHERE子句](#2.8)
  - [2.9 DELETE删除](#2.9)
  - [2.10 REMOVE删除](#2.10)
  - [2.11 SET子句](#2.11)
  - [2.12 Sorting排序](#2.12)
  - [2.13  UNION联盟](#2.13)
  - [2.14 LIMIT和SKIP](#2.14)
  - [2.15 并和](#2.15)
  - [2.16 NULL值](#2.16)
  - [2.17 IN操作符](#2.17)
  - [2.18 图形字体](#2.18) 
  - [2.19 ID属性](#2.19)
  - [2.20  Caption标题](#2.20)
  - [2.21 方向关系](#2.21)





CQL代表Cypher查询语言。 像Oracle数据库具有查询语言SQL，Neo4j具有CQL作为查询语言。

**Neo4j CQL -**

- 它是Neo4j图形数据库的查询语言。 
- 它是一种声明性模式匹配语言
- 它遵循SQL语法。 
- 它的语法是非常简单且人性化、可读的格式。 

**如Oracle SQL -**

- Neo4j CQL 已命令来执行数据库操作。
- Neo4j CQL 支持多个子句像在哪里，顺序等，以非常简单的方式编写非常复杂的查询。
- NNeo4j CQL 支持一些功能，如字符串，Aggregation.In 加入他们，它还支持一些关系功能。



## Neo4j CQL命令/条款

常用的Neo4j CQL命令/条款如下：

|       CQL命令       |           用法           |
| :-----------------: | :----------------------: |
|   CREATE    创建    |   创建节点，关系和属性   |
|    MATCH    匹配    | 检索有关节点，关系和属性 |
|    RETURN  返回     |       返回查询结果       |
|    WHERE    哪里    |   提供条件过滤检索数据   |
|   DELETE    删除    |      删除节点和关系      |
|    REMOVE   移除    |   删除节点和关系的属性   |
| ORDER BY  以...排序 |       排序检索数据       |
|      SET    组      |      添加或更新标签      |

## Neo4j CQL 函数

以下是常用的Neo4j CQL函数：

|   定制表格功能    |                      用法                      |
| :---------------: | :--------------------------------------------: |
| String    字符串  |            他们用于使用String字面量            |
| Aggregation 聚合  |     他们勇于对CQL查询结果执行一些聚合操作      |
| Relationship 关系 | 他们用于获取关系的细节，如startnode,encode等。 |

## Neo4j CQL数据类型

| CQL数据类型 |             用法              |
| :---------: | :---------------------------: |
|   boolean   | 用于表示布尔文字：true，false |
|    byte     |        用于表示8位整数        |
|    short    |       用于表示16位整数        |
|     int     |       用于表示32位整数        |
|    long     |       用于表示64位整数        |
|    float    |      I用于表示32位浮点数      |
|   double    |      用于表示64位浮点数       |
|    char     |       用于表示16位字符        |
|   String    |        用于表示字符串         |



# <a name="2">2 操作</a>

## <a name="2.1">2.1 CREATE 命令</a>

Neo4j使用CQL“CREATE”命令

- 创建没有属性的节点
- 使用属性创建节点
- 在没有属性的节点之间创建关系
- 使用属性创建节点之间的关系
- 为节点或关系创建单个或多个标签

**Neo4j CQL创建一个没有属性的节点**

Neo4j CQL“CREATE”命令用于创建没有属性的节点。 它只是创建一个没有任何数据的节点。

- CREATE命令语法

```python
# CREATE (<node-name>:<label-name>)
- CREATE	它是一个Neo4j CQL命令。
- <node-name>	它是我们要创建的节点名称。
- <label-name>	它是一个节点标签名称

# 例如

CREATE (emp:Employee)
```



**Neo4j CQL创建具有属性的节点**

Neo4j CQL“CREATE”命令用于创建带有属性的节点。 它创建一个具有一些属性（键值对）的节点来存储数据。

- CREATE命令语法：

```python
"""
CREATE (
   <node-name>:<label-name>
   { 	
      <Property1-name>:<Property1-Value>
      ........
      <Propertyn-name>:<Propertyn-Value>
   }
)
- <node-name>	它是我们将要创建的节点名称。
- <label-name>	它是一个节点标签名称
- <Property1-name>...<Propertyn-name>	属性是键值对。 定义将分配给创建节点的属性的名称
- <Property1-value>...<Propertyn-value>	属性是键值对。 定义将分配给创建节点的属性的值
"""

CREATE (dept:Dept { deptno:10,dname:"Accounting",location:"Hyderabad" })
CREATE (emp:Employee{id:123,name:"Lokesh",sal:35000,deptno:10})
```



## <a name="2.2">2.2 MATCH 命令</a>

Neo4j CQL MATCH命令用于 - 

- 从数据库获取有关节点和属性的数据
- 从数据库获取有关节点，关系和属性的数据

MATCH命令语法：

```python
"""
MATCH 
(
   <node-name>:<label-name>
)
- <node-name>	这是我们要创建一个节点名称。
- <label-name>	这是一个节点的标签名称
"""
MATCH (dept:Dept)
MATCH (dept:Dept) WHERE dept.dname="Accounting" return dept
```



## <a name="2.3">2.3 RETURN 命令</a>

 

Neo4j CQL RETURN子句用于 - 

- 检索节点的某些属性
- 检索节点的所有属性
- 检索节点和关联关系的某些属性
- 检索节点和关联关系的所有属性

RETURN命令语法：

```python
"""
RETURN 
   <node-name>.<property1-name>,
   ........
   <node-name>.<propertyn-name>

- <node-name>	它是我们将要创建的节点名称。
- <Property1-name>...<Propertyn-name>	属性是键值对。 <Property-name>定义要分配给创建节点的属性的名称
"""
RETURN dept.deptno
MATCH (dept:Dept) WHERE dept.dname="Accounting" return dept.deptno
```



## <a name="2.4">2.4 MATCH&RETURN 匹配和返回</a>

在Neo4j CQL中，我们不能单独使用MATCH或RETURN命令，因此我们应该合并这两个命令以从数据库检索数据。 

Neo4j使用CQL MATCH + RETURN命令 - 



- 检索节点的某些属性
- 检索节点的所有属性
- 检索节点和关联关系的某些属性
- 检索节点和关联关系的所有属性

MATCH RETURN命令语法：

```python
"""
MATCH Command
RETURN Command
"""
MATCH (dept: Dept) RETURN dept.deptno,dept.dname

MATCH (dept: Dept) RETURN dept.deptno,dept.dname,dept.location

MATCH (dept: Dept) RETURN dept
```





<a name="2.5">2.5 CREATE+MATCH+RETURN 命令</a>

```python
# 创建
CREATE (e:Customer{id:"1001",name:"Abc",dob:"01/10/1982"})
CREATE (cc:CreditCard{id:"5001",number:"1234567890",cvv:"888",expiredate:"20/17"})

# 查询
MATCH (e:Customer) RETURN e.id,e.name,e.dob

MATCH (cc:CreditCard) RETURN cc.id,cc.number,cc.cvv,cc.expiredate
```



<a name="2.6">2.6 关系基础</a>

Neo4j图数据库遵循属性图模型来存储和管理其数据。 

根据属性图模型，关系应该是定向的。 否则，Neo4j将抛出一个错误消息。 

基于方向性，Neo4j关系被分为两种主要类型。

- 单向关系
- 双向关系

在以下场景中，我们可以使用Neo4j CQL CREATE命令来创建两个节点之间的关系。 这些情况适用于Uni和双向关系。

- 在两个现有节点之间创建无属性的关系
- 在两个现有节点之间创建与属性的关系
- 在两个新节点之间创建无属性的关系
- 在两个新节点之间创建与属性的关系
- 在具有WHERE子句的两个退出节点之间创建/不使用属性的关系



<a name="2.7">2.7 CREATE 创建标签</a>

## Neo4j CQL创建节点标签

Label是Neo4j数据库中的节点或关系的名称或标识符。 

我们可以将此标签名称称为关系为“关系类型”。 

我们可以使用CQL CREATE命令为节点或关系创建单个标签，并为节点创建多个标签。 这意味着Neo4j仅支持两个节点之间的单个关系类型。 

我们可以在UI模式和网格模式下在CQL数据浏览器中观察此节点或关系的标签名称。 并且我们引用它执行CQL命令。 

到目前为止，我们只创建了一个节点或关系的标签，但我们没有讨论它的语法。 



使用Neo4j CQL CREATE命令

- 为节点创建单个标签
- 为节点创建多个标签
- 为关系创建单个标签

我们将在本章中讨论如何创建一个节点的单个标签或多个标签。 我们将在下一章讨论如何为关系创建一个单独的标签。

**单个标签到节点**

```python
"""
CREATE (<node-name>:<label-name>)
"""
CREATE (google1:GooglePlusProfile)

"""
CREATE (<node-name>:<label-name1>:<label-name2>.....:<label-namen>)
"""
CREATE (m:Movie:Cinema:Film:Picture)

"""
单个标签到关系
CREATE (<node1-name>:<label1-name>)-
        [(<relationship-name>:<relationship-label-name>)]
	      ->(<node2-name>:<label2-name>)
"""
CREATE (p1:Profile1)-[r1:LIKES]->(p2:Profile2)

```



<a name="2.8">2.8 WHERE子句</a>

像SQL一样，Neo4j CQL在CQL MATCH命令中提供了WHERE子句来过滤MATCH查询的结果。

```python
"""
简单WHERE子句语法
WHERE <condition>
"""

"""
复杂WHERE子句语法
WHERE <condition> <boolean-operator> <condition>
"""

"""
<condition>语法：
<property-name> <comparison-operator> <value>
"""
```

**Neo4j CQL中的布尔运算符**

| 布尔运算符 | 描述 |
| :--------: | :--: |
|    AND     |  与  |
|     OR     |  或  |
|    NOT     |  非  |
|    XOR     | 异或 |

**Neo4j CQL中的比较运算符**

| 布尔运算符 |    描述    |
| :--------: | :--------: |
|     =      |    等于    |
|     <>     |   不等于   |
|     <      |    小于    |
|     >      |    大于    |
|     <=     | 小于或等于 |
|     >=     | 大于或等于 |



```python
MATCH (emp:Employee) RETURN emp.empid,emp.name,emp.salary,emp.deptno

MATCH (emp:Employee)  WHERE emp.name = 'Abc' RETURN emp

#-=====================================-

MATCH (emp:Employee) RETURN emp.empid,emp.name,emp.salary,emp.deptno

MATCH (emp:Employee) WHERE emp.name = 'Abc' OR emp.name = 'Xyz' RETURN emp


```



**使用WHERE子句创建关系**

在Neo4J CQL中，我们可以以不同的方式创建拖曳节点之间的关系。 

- 创建两个现有节点之间的关系
- 一次创建两个节点和它们之间的关系
- 使用WHERE子句创建两个现有节点之间的关系

我们已经讨论了前两章中的前两种方法。 现在我们将在本章中讨论“使用WHERE子句创建两个现有节点之间的关系”。

```python
"""
MATCH (<node1-label-name>:<node1-name>),(<node2-label-name>:<node2-name>) 
WHERE <condition>
CREATE (<node1-label-name>)-[<relationship-label-name>:<relationship-name>
       {<relationship-properties>}]->(<node2-label-name>) 
"""

MATCH (cust:Customer) RETURN cust.id,cust.name,cust.dob

MATCH (cc:CreditCard) RETURN cc.id,cc.number,cc.expiredate,cc.cvv

MATCH (cust:Customer),(cc:CreditCard) 
WHERE cust.id = "1001" AND cc.id= "5001" 
CREATE (cust)-[r:DO_SHOPPING_WITH{shopdate:"12/12/2014",price:55000}]->(cc) 
RETURN r

```



<a name="2.9">2.9 DELETE删除</a>

Neo4j使用CQL DELETE子句

- 删除节点。
- 删除节点及相关节点和关系。

我们将在本章中讨论如何删除一个节点。 我们将在下一章讨论如何删除节点和相关的节点和关系。

**删除节点**

通过使用此命令，我们可以从数据库永久删除节点及其关联的属性。

```python
"""
DELETE节点子句语法
DELETE <node-name-list>
"""
"""
MATCH (e: 'Employee') RETURN e 

注意 -
MATCH (e: 'Employee') RETURN e
MATCH (e: "Employee") RETURN e
MATCH (e: Employee) RETURN e

所有三个命令都相同，我们可以选择这些命令中的任何一个。
"""

MATCH (e: Employee) DELETE e

MATCH (e: Employee) RETURN e

```



```python
"""
DELETE节点和关系子句语法

DELETE <node1-name>,<node2-name>,<relationship-name>
"""

MATCH (cc:CreditCard)-[r]-(c:Customer)RETURN r 

MATCH (cc: CreditCard)-[rel]-(c:Customer) 
DELETE cc,c,rel


MATCH (cc:CreditCard)-[r]-(c:Customer) RETURN r

```



<a name="2.10">2.10 REMOVE删除</a>

**删除节点/关系的属性** 

我们可以使用相同的语法从数据库中永久删除节点或关系的属性或属性列表。 

- REMOVE属性子句语法

```python
"""
REMOVE <property-name-list>
"""

""" <property-name-list> <属性名称列表>语法

<node-name>.<property1-name>,
<node-name>.<property2-name>, 
.... 
<node-name>.<propertyn-name> 
"""
```



```python
CREATE (book:Book {id:122,title:"Neo4j Tutorial",pages:340,price:250}) 

CREATE TABLE BOOK(
	id number,
	title varchar2(20),
	pages number,
	pages number
);
INSERT INTO BOOK VALUES (122,'Neo4j Tutorial',340,250);

MATCH (book : Book)
RETURN book

SELECT * FROM BOOK;

MATCH (book { id:122 })
REMOVE book.price
RETURN book

ALTER TABLE BOOK REMOVE COLUMN PRICE;
SELECT * FROM BOOK WHERE ID = 122;

MATCH (dc:DebitCard) 
RETURN dc

MATCH (dc:DebitCard) 
REMOVE dc.cvv
RETURN dc
```



<a name="2.11">2.11 SET子句</a>



<a name="2.12">2.12 Sorting排序 </a>



<a name="2.13">2.13  UNION联盟</a>



<a name="2.14">2.14 LIMIT和SKIP</a>



<a name="2.15">2.15 并和</a>



<a name="2.16">2.16 NULL值</a>



<a name="2.17">2.17 IN操作符</a>



<a name="2.18">2.18 图形字体</a>



<a name="2.19">2.19 ID属性</a>



<a name="2.20">2.20  Caption标题</a>



<a name="2.21">2.21 方向关系</a>





```
match(p:Disease),(q:Food) where p.name='rels'and q.name='recommandeat' create (p)-[rel:recommand_eat{name:'推荐食谱'}]->(q)
```